Repository: med-aziz-kaboudi/cha9cha9ni-front
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Welcome back
ar: مرحبا بعودتك
fr: Bienvenue à nouveau

source: Create new account
ar: إنشاء حساب جديد
fr: Créer un nouveau compte

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟
fr: Vous avez déjà un compte ?

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte ?

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Sign Up
ar: إنشاء حساب
fr: S'inscrire

source: First name *
ar: الاسم الأول *
fr: Prénom *

source: Last name *
ar: اسم العائلة *
fr: Nom de famille *

# enterEmail
source: Enter your email *
ar: أدخل بريدك الإلكتروني *
fr: Entrez votre email *

source: Phone number *
ar: رقم الهاتف *
fr: Numéro de téléphone *

# enterPassword
source: Enter your password *
ar: أدخل كلمة المرور *
fr: Entrez votre mot de passe *

source: Forgot Password?
ar: نسيت كلمة المرور؟
fr: Mot de passe oublié ?

source: or sign in with
ar: أو سجل الدخول باستخدام
fr: ou se connecter avec

source: or sign up with
ar: أو أنشئ حساباً باستخدام
fr: ou s'inscrire avec

source: Sign in with Google
ar: تسجيل الدخول باستخدام جوجل
fr: Se connecter avec Google

source: Sign up with Google
ar: إنشاء حساب باستخدام جوجل
fr: S'inscrire avec Google

# passwordRequirement1
source: Must contain at least 8 characters
ar: يجب أن تحتوي على 8 أحرف على الأقل
fr: Doit contenir au moins 8 caractères

# passwordRequirement2
source: Contains a number
ar: تحتوي على رقم
fr: Contient un chiffre

# passwordRequirement3
source: Contains an uppercase letter
ar: تحتوي على حرف كبير
fr: Contient une lettre majuscule

# passwordRequirement4
source: Contains a special character
ar: تحتوي على رمز خاص
fr: Contient un caractère spécial

# passwordStrong
source: Strong password!
ar: كلمة مرور قوية!
fr: Mot de passe fort !

source: Password requirements
ar: متطلبات كلمة المرور
fr: Exigences du mot de passe

# termsAgreement
source: By clicking "{action}" you agree to Cha9cha9ni
ar: بالنقر على "{action}" فإنك توافق على
fr: En cliquant sur "{action}", vous acceptez les

source: Term of Use
ar: شروط الاستخدام
fr: Conditions d'utilisation

source: and
ar: و
fr: et la

source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de confidentialité

source: Skip
ar: تخطي
fr: Passer

source: Back
ar: رجوع
fr: Retour

source: Next
ar: التالي
fr: Suivant

source: Get Started
ar: ابدأ الآن
fr: Commencer

# onboarding1Title
source: Saving Works Better When We Do It Together
ar: التوفير يصبح أفضل عندما نقوم به معًا
fr: L'épargne Fonctionne Mieux Quand Nous le Faisons Ensemble

# onboarding1Description
source: Bring your family into one shared space and grow your savings step by step.
ar: اجمع عائلتك في مساحة واحدة مشتركة وعزز مدخراتك خطوة بخطوة.
fr: Réunissez votre famille dans un espace partagé et développez votre épargne étape par étape.

# onboarding2Title
source: Save For the Moments You Care About
ar: وفّر للحظات التي تهمك
fr: Économisez Pour les Moments Qui Vous Tiennent à Cœur

# onboarding2Description
source: Thoughtful planning for meaningful moments, bringing peace and joy to your family.
ar: التخطيط المدروس للحظات المميزة، يجلب السلام والفرح لعائلتك.
fr: Une planification réfléchie pour des moments significatifs, apportant paix et joie à votre famille.

source: OTP Verification
ar: التحقق من الرمز
fr: Vérification OTP

# verifyEmailSubtitle
source: We need to verify your email
ar: نحتاج للتحقق من بريدك الإلكتروني
fr: Nous devons vérifier votre email

# verifyEmailDescription
source: To verify your account, enter the 6 digit OTP code that we sent to your email.
ar: للتحقق من حسابك، أدخل رمز التحقق المكون من 6 أرقام الذي أرسلناه إلى بريدك الإلكتروني.
fr: Pour vérifier votre compte, entrez le code OTP à 6 chiffres que nous avons envoyé à votre email.

source: Verify
ar: تحقق
fr: Vérifier

source: Resend OTP
ar: إعادة إرسال الرمز
fr: Renvoyer le code

source: Resend OTP
ar: إعادة إرسال الرمز
fr: Renvoyer le code

# resendOTPIn
source: Resend OTP in {seconds}s
ar: إعادة إرسال الرمز خلال {seconds} ثانية
fr: Renvoyer le code dans {seconds}s

# codeExpiresInfo
source: The code expires in 15 minutes
ar: ينتهي صلاحية الرمز خلال 15 دقيقة
fr: Le code expire dans 15 minutes

# enterAllDigits
source: Please enter all 6 digits
ar: الرجاء إدخال جميع الأرقام الستة
fr: Veuillez entrer les 6 chiffres

# emailVerifiedSuccess
source: ✅ Email verified successfully!
ar: تم التحقق من البريد الإلكتروني بنجاح!
fr: ✅ Email vérifié avec succès!

# verificationFailed
source: Verification failed: {error}
ar: فشل التحقق: {error}
fr: Échec de la vérification: {error}

source: Verification Success!
ar: تم التحقق بنجاح!
fr: Vérification Réussie!

# verificationSuccessSubtitle
source: Your email has been verified successfully. You can now access all features.
ar: تم التحقق من بريدك الإلكتروني بنجاح. يمكنك الآن الوصول إلى جميع الميزات.
fr: Votre email a été vérifié avec succès. Vous pouvez maintenant accéder à toutes les fonctionnalités.

source: Okay
ar: حسناً
fr: D'accord

# pleaseWaitSeconds
source: Please wait {seconds} seconds before requesting a new code
ar: يرجى الانتظار {seconds} ثانية قبل طلب رمز جديد
fr: Veuillez attendre {seconds} secondes avant de demander un nouveau code

source: Email already verified
ar: البريد الإلكتروني مُفعّل بالفعل
fr: Email déjà vérifié

source: User not found
ar: المستخدم غير موجود
fr: Utilisateur non trouvé

source: Invalid verification code
ar: رمز التحقق غير صحيح
fr: Code de vérification invalide

# verificationCodeExpired
source: Verification code expired. Please request a new one.
ar: انتهت صلاحية رمز التحقق. يرجى طلب رمز جديد.
fr: Code de vérification expiré. Veuillez en demander un nouveau.

# noVerificationCode
source: No verification code found. Please request a new one.
ar: لا يوجد رمز تحقق. يرجى طلب رمز جديد.
fr: Aucun code de vérification trouvé. Veuillez en demander un nouveau.

# registrationSuccessful
source: Registration successful! Please sign in to verify your email.
ar: تم التسجيل بنجاح! يرجى تسجيل الدخول للتحقق من بريدك الإلكتروني.
fr: Inscription réussie ! Veuillez vous connecter pour vérifier votre email.

source: Reset Password
ar: إعادة تعيين كلمة المرور
fr: Réinitialiser le Mot de Passe

source: New Password
ar: كلمة المرور الجديدة
fr: Nouveau Mot de Passe

# enterNewPassword
source: Enter your new password
ar: أدخل كلمة المرور الجديدة
fr: Entrez votre nouveau mot de passe

source: Confirm Password
ar: تأكيد كلمة المرور
fr: Confirmer le Mot de Passe

source: Confirm your password
ar: أكد كلمة المرور
fr: Confirmez votre mot de passe

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين
fr: Les mots de passe ne correspondent pas

# confirmPasswordRequired
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور
fr: Veuillez confirmer votre mot de passe

# passwordResetSuccessfully
source: Password reset successfully! You can now sign in with your new password.
ar: تم إعادة تعيين كلمة المرور بنجاح! يمكنك الآن تسجيل الدخول بكلمة المرور الجديدة.
fr: Mot de passe réinitialisé avec succès ! Vous pouvez maintenant vous connecter avec votre nouveau mot de passe.

source: Check Your Mailbox
ar: تفقد بريدك الإلكتروني
fr: Vérifiez Votre Boîte Mail

# weHaveSentResetCodeTo
source: We have sent a 6-digit reset code to {email}
ar: لقد أرسلنا رمز إعادة التعيين المكون من 6 أرقام إلى {email}
fr: Nous avons envoyé un code de réinitialisation à 6 chiffres à {email}

# pleaseEnterEmail
source: Please enter your email address
ar: يرجى إدخال عنوان بريدك الإلكتروني
fr: Veuillez entrer votre adresse email

# invalidEmailFormat
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صحيح
fr: Veuillez entrer une adresse email valide

# pleaseEnterComplete6DigitCode
source: Please enter the complete 6-digit code
ar: يرجى إدخال الرمز المكون من 6 أرقام كاملاً
fr: Veuillez entrer le code complet à 6 chiffres

# codeSentSuccessfully
source: Code sent successfully! Please check your email.
ar: تم إرسال الرمز بنجاح! يرجى التحقق من بريدك الإلكتروني.
fr: Code envoyé avec succès ! Veuillez vérifier votre email.

# anErrorOccurred
source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
fr: Une erreur s'est produite. Veuillez réessayer.

source: Didn't receive code?
ar: لم تتلق الرمز؟
fr: Vous n'avez pas reçu le code ?

# passwordRequired
source: Password is required
ar: كلمة المرور مطلوبة
fr: Le mot de passe est requis

# passwordMinLength
source: Password must be at least 8 characters
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل
fr: Le mot de passe doit contenir au moins 8 caractères

source: Enter your password
ar: أدخل كلمة المرور
fr: Entrez votre mot de passe

# joinOrCreateFamily
source: Join or Create a Family
ar: انضم أو أنشئ عائلة
fr: Rejoindre ou Créer une Famille

# chooseHowToProceed
source: Choose how you want to proceed
ar: اختر كيف تريد المتابعة
fr: Choisissez comment vous souhaitez continuer

source: Create a Family
ar: إنشاء عائلة
fr: Créer une Famille

source: Join a Family
ar: الانضمام لعائلة
fr: Rejoindre une Famille

# enterInviteCode
source: Enter Redemption Code
ar: أدخل رمز الاستبدال
fr: Entrer le code de remboursement

# pleaseEnterInviteCode
source: Please enter an invite code
ar: الرجاء إدخال رمز الدعوة
fr: Veuillez entrer le code d'invitation

source: Failed to create family
ar: فشل إنشاء العائلة
fr: Échec de la création de la famille

source: Failed to join family
ar: فشل الانضمام للعائلة
fr: Échec de rejoindre la famille

source: Join Now
ar: انضم الآن
fr: Rejoindre Maintenant

source: Cancel
ar: إلغاء
fr: Annuler

source: Sign Out
ar: تسجيل الخروج
fr: Se Déconnecter

source: Family Invite Code
ar: رمز دعوة العائلة
fr: Code d'Invitation Familiale

# shareThisCode
source: Share this code with your family members so they can join your family.
ar: شارك هذا الرمز مع أفراد عائلتك حتى يتمكنوا من الانضمام
fr: Partagez ce code avec les membres de votre famille pour qu'ils puissent rejoindre

source: Copy Code
ar: نسخ الرمز
fr: Copier le Code

# codeCopied
source: Invite code copied to clipboard!
ar: تم نسخ رمز الدعوة!
fr: Code d'invitation copié!

source: Got it!
ar: فهمت!
fr: Compris!

source: Welcome, Family Owner!
ar: مرحباً، مالك العائلة!
fr: Bienvenue, Propriétaire de la Famille!

source: Welcome, Family Member!
ar: مرحباً، عضو العائلة!
fr: Bienvenue, Membre de la Famille!

source: Your Family
ar: عائلتك
fr: Votre Famille

source: Owner
ar: المالك
fr: Propriétaire

source: Members
ar: الأعضاء
fr: Membres

source: No code available
ar: لا يوجد رمز متاح
fr: Aucun code disponible

source: Invite code copied to clipboard!
ar: تم نسخ رمز الدعوة!
fr: Code d'invitation copié!

# shareCodeWithFamilyMembers
source: Share this code with family members. It will change after each use.
ar: شارك هذا الرمز مع أفراد العائلة. سيتغير بعد كل استخدام.
fr: Partagez ce code avec les membres de votre famille. Il changera après chaque utilisation.

source: Scan button tapped
ar: تم النقر على زر المسح
fr: Bouton de scan appuyé

source: Reward screen coming soon
ar: شاشة المكافآت قريباً
fr: Écran de récompenses bientôt disponible

source: Home
ar: الرئيسية
fr: Accueil

source: Reward
ar: المكافآت
fr: Récompenses

source: My Family
ar: عائلتي
fr: Ma Famille

source: Personal information
ar: المعلومات الشخصية
fr: Informations personnelles

source: Your current pack
ar: باقتك الحالية
fr: Votre Pack Actuel

# loginAndSecurity
source: Log in & security
ar: تسجيل الدخول والأمان
fr: Connexion et sécurité

source: Languages
ar: اللغات
fr: Langues

source: Notifications
ar: الإشعارات

source: Help
ar: المساعدة
fr: Aide

source: Legal Agreements
ar: الاتفاقيات القانونية
fr: Accords juridiques

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Balance
ar: الرصيد
fr: Solde

source: Top up
ar: شحن
fr: Recharger

source: withdraw
ar: سحب
fr: Retirer

source: Statement
ar: كشف الحساب
fr: Relevé

source: Next Withdrawal
ar: السحب القادم
fr: Prochain retrait

# availableInDays
source: Available in {days} days
ar: متاح خلال {days} يوم
fr: Disponible dans {days} jours

source: Family Members
ar: أفراد العائلة
fr: Membres de la Famille

source: Manage >
ar: إدارة >
fr: Gérer >

source: Recent activities :
ar: الأنشطة الأخيرة :
fr: Activités récentes :

source: View all
ar: عرض الكل
fr: Voir tout

# googleSignInCancelled
source: Sign In Cancelled
ar: تم إلغاء تسجيل الدخول
fr: Connexion Annulée

# googleSignInCancelledMessage
source: You cancelled the Google sign in. Please try again to continue.
ar: لقد ألغيت تسجيل الدخول باستخدام Google. يرجى المحاولة مرة أخرى للمتابعة.
fr: Vous avez annulé la connexion Google. Veuillez réessayer pour continuer.

source: Try Again
ar: حاول مرة أخرى
fr: Réessayer

source: Close
ar: إغلاق
fr: Fermer

source: pts
ar: نقطة

# sessionExpiredTitle
source: Session Expired
ar: انتهت الجلسة
fr: Session Expirée

# sessionExpiredMessage
source: Another device has logged into your account. You will be signed out for security.
ar: تم تسجيل الدخول من جهاز آخر إلى حسابك. سيتم تسجيل خروجك لأسباب أمنية.
fr: Un autre appareil s'est connecté à votre compte. Vous serez déconnecté pour des raisons de sécurité.

source: OK
ar: حسناً

# skipTutorial
source: Skip Guide
ar: تخطي الدليل
fr: Passer le guide

# nextTutorial
source: Next
ar: التالي
fr: Suivant

# doneTutorial
source: Got it!
ar: فهمت!
fr: Compris!

# tutorialSidebarTitle
source: Menu
ar: القائمة

# tutorialSidebarDesc
source: Tap here to open the sidebar menu. Access your profile, settings, and more options.
ar: اضغط هنا لفتح القائمة الجانبية. الوصول إلى ملفك الشخصي والإعدادات والمزيد.
fr: Appuyez ici pour ouvrir le menu latéral. Accédez à votre profil, paramètres et plus.

# tutorialTopUpTitle
source: Top Up
ar: إضافة رصيد
fr: Recharger

# tutorialTopUpDesc
source: Add money to your family account. Share funds with your family members easily.
ar: أضف المال إلى حساب العائلة. شارك الأموال مع أفراد عائلتك بسهولة.
fr: Ajoutez de l'argent à votre compte familial. Partagez des fonds facilement.

# tutorialWithdrawTitle
source: Withdraw
ar: سحب
fr: Retirer

# tutorialWithdrawDesc
source: Request to withdraw money from your family savings when you need it.
ar: اطلب سحب المال من مدخرات عائلتك عند الحاجة.
fr: Demandez à retirer de l'argent de vos économies familiales.

# tutorialStatementTitle
source: Statement
ar: كشف الحساب
fr: Relevé

# tutorialStatementDesc
source: View all your transactions history. Track your family's spending and savings.
ar: عرض سجل جميع معاملاتك. تتبع إنفاق ومدخرات عائلتك.
fr: Consultez l'historique de toutes vos transactions. Suivez les dépenses et économies.

# tutorialPointsTitle
source: Reward Points
ar: نقاط المكافآت
fr: Points de Récompense

# tutorialPointsDesc
source: Earn points for every activity! Redeem them for exclusive rewards and benefits.
ar: اكسب نقاطاً مع كل نشاط! استبدلها بمكافآت ومزايا حصرية.
fr: Gagnez des points pour chaque activité! Échangez-les contre des récompenses.

# tutorialNotificationTitle
source: Notifications
ar: الإشعارات

# tutorialNotificationDesc
source: Stay updated with family activities, transactions, and important alerts.
ar: ابق على اطلاع بأنشطة العائلة والمعاملات والتنبيهات المهمة.
fr: Restez informé des activités familiales, transactions et alertes importantes.

# tutorialQrCodeTitle
source: QR Scanner
ar: ماسح QR
fr: Scanner QR

# tutorialQrCodeDesc
source: Scan QR codes to make quick payments or add new family members.
ar: امسح رموز QR لإجراء مدفوعات سريعة أو إضافة أفراد جدد للعائلة.
fr: Scannez des codes QR pour des paiements rapides ou ajouter des membres.

# tutorialRewardTitle
source: Rewards
ar: المكافآت
fr: Récompenses

# tutorialRewardDesc
source: Explore and redeem your earned points for amazing rewards and discounts.
ar: استكشف واستبدل نقاطك المكتسبة بمكافآت وخصومات رائعة.
fr: Explorez et échangez vos points gagnés contre des récompenses et réductions.

source: Edit Profile
ar: تعديل الملف الشخصي
fr: Modifier le Profil

source: Save Changes
ar: حفظ التغييرات
fr: Enregistrer

source: Email
ar: البريد الإلكتروني

# firstNameLabel
source: First name
ar: الاسم الأول
fr: Prénom

# lastNameLabel
source: Last name
ar: اسم العائلة
fr: Nom de famille

# phoneNumberLabel
source: Phone number
ar: رقم الهاتف
fr: Numéro de téléphone

# firstNameRequired
source: First name is required
ar: الاسم الأول مطلوب
fr: Le prénom est requis

# lastNameRequired
source: Last name is required
ar: اسم العائلة مطلوب
fr: Le nom de famille est requis

source: Profile updated successfully!
ar: تم تحديث الملف الشخصي بنجاح!
fr: Profil mis à jour avec succès!

source: Remove
ar: حذف
fr: Supprimer

source: Full name
ar: الاسم الكامل
fr: Nom complet

source: Edit
ar: تعديل
fr: Modifier

source: Change Email
ar: تغيير البريد الإلكتروني
fr: Changer l'Email

# verifyCurrentEmailDesc
source: To change your email, we first need to verify your current email address.
ar: لتغيير بريدك الإلكتروني، نحتاج أولاً للتحقق من بريدك الإلكتروني الحالي.
fr: Pour changer votre email, nous devons d'abord vérifier votre adresse email actuelle.

source: Send Verification Code
ar: إرسال رمز التحقق
fr: Envoyer le Code

# enterCodeSentTo
source: Enter the 6-digit code sent to {email}
ar: أدخل الرمز المكون من 6 أرقام المرسل إلى {email}
fr: Entrez le code à 6 chiffres envoyé à {email}

source: Current email verified
ar: تم التحقق من البريد الإلكتروني الحالي
fr: Email actuel vérifié

# enterNewEmail
source: Enter your new email address
ar: أدخل عنوان بريدك الإلكتروني الجديد
fr: Entrez votre nouvelle adresse email

source: Confirm Change
ar: تأكيد التغيير
fr: Confirmer le Changement

source: Email updated successfully!
ar: تم تحديث البريد الإلكتروني بنجاح!
fr: Email mis à jour avec succès!

# phoneNumberMustBe8Digits
source: Phone number must be exactly 8 digits
ar: يجب أن يتكون رقم الهاتف من 8 أرقام بالضبط
fr: Le numéro de téléphone doit comporter exactement 8 chiffres

# phoneNumberAlreadyInUse
source: This phone number is already in use
ar: رقم الهاتف هذا مستخدم بالفعل
fr: Ce numéro de téléphone est déjà utilisé

source: Add Member
ar: إضافة عضو
fr: Ajouter un Membre

# shareInviteCodeDesc
source: Share this code with your family member to add them
ar: شارك هذا الرمز مع أحد أفراد عائلتك لإضافته
fr: Partagez ce code avec votre membre de famille pour l'ajouter

source: Copy
ar: نسخ
fr: Copier

source: No members yet
ar: لا يوجد أعضاء بعد
fr: Pas encore de membres

# tapAddMemberToInvite
source: Tap "Add Member" to invite your family
ar: اضغط على "إضافة عضو" لدعوة عائلتك
fr: Appuyez sur "Ajouter un Membre" pour inviter votre famille

source: Remove Member
ar: إزالة العضو
fr: Supprimer le Membre

# removeMemberConfirm
source: Are you sure you want to remove {name} from the family?
ar: هل أنت متأكد أنك تريد إزالة {name} من العائلة؟
fr: Êtes-vous sûr de vouloir supprimer {name} de la famille ?

source: Confirm Removal
ar: تأكيد الإزالة
fr: Confirmer la Suppression

# enterCodeSentToEmail
source: Enter the verification code sent to your email
ar: أدخل رمز التحقق المرسل إلى بريدك الإلكتروني
fr: Entrez le code de vérification envoyé à votre email

# enterValidCode
source: Enter a valid 6-digit code
ar: أدخل رمزًا صالحًا مكونًا من 6 أرقام
fr: Entrez un code à 6 chiffres valide

# removalInitiated
source: Removal request sent to {name}
ar: تم إرسال طلب الإزالة إلى {name}
fr: Demande de suppression envoyée à {name}

source: Accept Removal
ar: قبول الإزالة
fr: Accepter la Suppression

# acceptRemovalConfirm
source: {name} wants to remove you from the family. Do you accept?
ar: {name} يريد إزالتك من العائلة. هل توافق؟
fr: {name} souhaite vous retirer de la famille. Acceptez-vous ?

source: Decline
ar: رفض
fr: Refuser

source: Accept
ar: قبول
fr: Accepter

source: Confirm Leave
ar: تأكيد المغادرة
fr: Confirmer le Départ

source: Removed from Family
ar: تمت الإزالة من العائلة
fr: Retiré de la Famille

# removedFromFamilyDesc
source: You have been successfully removed from the family. You can now join or create a new family.
ar: تمت إزالتك من العائلة بنجاح. يمكنك الآن الانضمام أو إنشاء عائلة جديدة.
fr: Vous avez été retiré de la famille avec succès. Vous pouvez maintenant rejoindre ou créer une nouvelle famille.

# removalRequestTitle
source: Removal Request
ar: طلب إزالة
fr: Demande de Suppression

# removalRequestDesc
source: {name} wants to remove you from the family.
ar: {name} يريد إزالتك من العائلة.
fr: {name} souhaite vous retirer de la famille.

source: View Request
ar: عرض الطلب
fr: Voir la Demande

# verificationCodeWillBeSent
source: A verification code will be sent to your email
ar: سيتم إرسال رمز التحقق إلى بريدك الإلكتروني
fr: Un code de vérification sera envoyé à votre email

source: Pending Removal Requests
ar: طلبات الإزالة المعلقة
fr: Demandes de Suppression en Attente

# cancelRemovalRequest
source: Cancel Request
ar: إلغاء الطلب
fr: Annuler la Demande

# cancelRemovalConfirm
source: Are you sure you want to cancel the removal request for {name}?
ar: هل أنت متأكد أنك تريد إلغاء طلب الإزالة لـ {name}؟
fr: Êtes-vous sûr de vouloir annuler la demande de suppression pour {name} ?

# removalCancelled
source: Removal request cancelled
ar: تم إلغاء طلب الإزالة
fr: Demande de suppression annulée

source: Waiting for member confirmation
ar: في انتظار تأكيد العضو
fr: En attente de la confirmation du membre

# pendingRemoval
source: Pending
ar: معلق
fr: En attente

source: Select Language
ar: اختر اللغة
fr: Sélectionner la langue

# choosePreferredLanguage
source: Choose your preferred language
ar: اختر لغتك المفضلة
fr: Choisissez votre langue préférée

# languageChanged
source: Language changed successfully
ar: تم تغيير اللغة بنجاح
fr: Langue modifiée avec succès

# currentLanguage
source: Current
ar: الحالية
fr: Actuel

source: Login & Security
ar: تسجيل الدخول والأمان
fr: Connexion & Sécurité

# securityDescription
source: Add an extra layer of security to protect your account and family data.
ar: أضف طبقة حماية إضافية لحماية حسابك وبيانات عائلتك.
fr: Ajoutez une couche de sécurité supplémentaire pour protéger votre compte et les données de votre famille.

source: Passkey
ar: رمز الدخول
fr: Code d'accès

# sixDigitPasskey
source: 6-Digit Passkey
ar: رمز من 6 أرقام
fr: Code à 6 chiffres

# passkeyEnabled
source: Enabled
ar: مفعّل
fr: Activé

# passkeyNotSet
source: Not set up
ar: غير مُعدّ
fr: Non configuré

# passkeyEnabledDescription
source: Your account is protected with a 6-digit passkey.
ar: حسابك محمي برمز من 6 أرقام.
fr: Votre compte est protégé par un code à 6 chiffres.

# passkeyDescription
source: Save this device for passwordless login. Like PayPal and Wise, you'll be able to log in instantly without entering your password.
ar: احفظ هذا الجهاز لتسجيل الدخول بدون كلمة مرور. مثل PayPal و Wise، ستتمكن من تسجيل الدخول فوراً.
fr: Enregistrez cet appareil pour une connexion sans mot de passe. Comme PayPal et Wise, vous pourrez vous connecter instantanément.

source: Set Up Passkey
ar: إعداد مفتاح المرور
fr: Configurer la clé d'accès

# changePasskey
source: Change
ar: تغيير
fr: Modifier

source: Remove Passkey
ar: حذف الرمز
fr: Supprimer le code

# removePasskeyConfirm
source: This will also disable biometric authentication. You will need to set up a new passkey to re-enable security features.
ar: سيؤدي هذا أيضًا إلى تعطيل المصادقة البيومترية. ستحتاج إلى إعداد رمز جديد لإعادة تفعيل ميزات الأمان.
fr: Cela désactivera également l'authentification biométrique. Vous devrez configurer un nouveau code pour réactiver les fonctionnalités de sécurité.

source: Verify Passkey
ar: التحقق من الرمز
fr: Vérifier le code

# enterPasskeyToRemove
source: Enter your passkey to confirm removal
ar: أدخل رمزك لتأكيد الحذف
fr: Entrez votre code pour confirmer la suppression

source: Current Passkey
ar: الرمز الحالي
fr: Code actuel

# enterCurrentPasskey
source: Enter your current passkey
ar: أدخل رمزك الحالي
fr: Entrez votre code actuel

source: New Passkey
ar: الرمز الجديد
fr: Nouveau code
