Repository: med-aziz-kaboudi/cha9cha9ni-front
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# activityWatchedAd
source: {name} watched an ad
ar: {name} شاهد إعلان
fr: {name} a regardé une pub

# activityDailyCheckIn
source: {name} claimed daily check-in
ar: {name} حصل على مكافأة الدخول اليومي
fr: {name} a réclamé la connexion quotidienne

# activityTopUp
source: {name} topped up
ar: {name} قام بالشحن
fr: {name} a rechargé

# activityReferral
source: {name} referral bonus
ar: مكافأة إحالة {name}
fr: Bonus de parrainage de {name}

# activityEarnedPoints
source: {name} earned points
ar: {name} كسب نقاط
fr: {name} a gagné des points

source: Filter Activities
ar: تصفية الأنشطة
fr: Filtrer les activités

# filterByTime
source: By Time Period
ar: حسب الفترة الزمنية
fr: Par période

# filterByType
source: By Activity Type
ar: حسب نوع النشاط
fr: Par type d'activité

# filterAll
source: All
ar: الكل
fr: Tout

# filterLast7Days
source: Last 7 days
ar: آخر 7 أيام
fr: 7 derniers jours

# filterLast30Days
source: Last 30 days
ar: آخر 30 يوم
fr: 30 derniers jours

# filterLast3Months
source: Last 3 months
ar: آخر 3 أشهر
fr: 3 derniers mois

# filterAllTypes
source: All Types
ar: جميع الأنواع
fr: Tous les types

# filterAds
source: Ads
ar: الإعلانات
fr: Publicités

# filterCheckIn
source: Check-in
ar: تسجيل الدخول اليومي

# filterTopUp
source: Top Up
ar: الشحن
fr: Recharge

# filterReferral
source: Referral
ar: الإحالة
fr: Parrainage

# filterOther
source: Other
ar: أخرى
fr: Autre

source: Apply Filters
ar: تطبيق الفلاتر
fr: Appliquer

source: Clear Filters
ar: مسح الفلاتر
fr: Effacer les filtres

# noActivitiesForFilter
source: No activities match your filters
ar: لا توجد أنشطة تطابق الفلاتر المحددة
fr: Aucune activité ne correspond à vos filtres
