Repository: med-aziz-kaboudi/cha9cha9ni-front
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# enterNewPasskey
source: Enter your new 6-digit passkey
ar: أدخل رمزك الجديد المكون من 6 أرقام
fr: Entrez votre nouveau code à 6 chiffres

source: Confirm passkey
ar: تأكيد الرمز
fr: Confirmer le code

source: Passkey must be 6 digits
ar: يجب أن يتكون الرمز من 6 أرقام
fr: Le code doit contenir 6 chiffres

source: Passkeys do not match
ar: الرموز غير متطابقة
fr: Les codes ne correspondent pas

# passkeySetupSuccess
source: Passkey set up successfully
ar: تم إعداد الرمز بنجاح
fr: Code configuré avec succès

# passkeyChangedSuccess
source: Passkey changed successfully
ar: تم تغيير الرمز بنجاح
fr: Code modifié avec succès

# passkeyRemovedSuccess
source: Security settings removed
ar: تم حذف إعدادات الأمان
fr: Paramètres de sécurité supprimés

source: Face ID
ar: التعرف على الوجه

source: Fingerprint
ar: بصمة الإصبع
fr: Empreinte digitale

source: Biometrics
ar: البيومترية
fr: Biométrie

# biometricEnabled
source: Enabled
ar: مفعّل
fr: Activé

# biometricDisabled
source: Disabled
ar: معطّل
fr: Désactivé

# biometricDescription
source: Use biometrics for quick and secure access. Falls back to passkey if biometric fails.
ar: استخدم البيومترية للوصول السريع والآمن. يرجع للرمز في حالة الفشل.
fr: Utilisez la biométrie pour un accès rapide et sécurisé. Revient au code en cas d'échec.

# biometricsNotAvailable
source: Biometrics not available on this device
ar: البيومترية غير متاحة على هذا الجهاز
fr: Biométrie non disponible sur cet appareil

# confirmBiometric
source: Confirm biometric to enable
ar: تأكيد البيومترية للتفعيل
fr: Confirmez la biométrie pour activer

# biometricAuthFailed
source: Biometric authentication failed
ar: فشلت المصادقة البيومترية
fr: Échec de l'authentification biométrique

source: How it works
ar: كيف يعمل
fr: Comment ça marche

# securityStep1
source: When you open the app, you'll be asked to verify your identity.
ar: عند فتح التطبيق، سيُطلب منك التحقق من هويتك.
fr: Lorsque vous ouvrez l'application, vous devrez vérifier votre identité.

# securityStep2
source: First, biometric verification (Face ID / Fingerprint) is attempted if enabled.
ar: أولاً، يتم محاولة التحقق البيومتري (التعرف على الوجه / البصمة) إذا كان مفعلاً.
fr: D'abord, la vérification biométrique (Face ID / Empreinte) est tentée si activée.

# securityStep3
source: If biometric fails or is disabled, enter your 6-digit passkey.
ar: إذا فشلت البيومترية أو كانت معطلة، أدخل رمزك المكون من 6 أرقام.
fr: Si la biométrie échoue ou est désactivée, entrez votre code à 6 chiffres.

# securityStep4
source: After 3 failed attempts, your account will be temporarily locked for your protection.
ar: بعد 3 محاولات فاشلة، سيتم قفل حسابك مؤقتًا لحمايتك.
fr: Après 3 échecs, votre compte sera temporairement verrouillé pour votre protection.

source: Confirm
ar: تأكيد
fr: Confirmer

source: Unlock App
ar: فتح التطبيق
fr: Déverrouiller l'application

# enterPasskeyToUnlock
source: Enter your passkey to unlock
ar: أدخل رمزك للفتح
fr: Entrez votre code pour déverrouiller

# attemptsRemaining
source: {count} attempts remaining
ar: {count} محاولات متبقية
fr: {count} tentatives restantes

source: Account Locked
ar: الحساب مقفل
fr: Compte verrouillé

# accountLockedFor
source: Account locked for {duration}
ar: الحساب مقفل لمدة {duration}
fr: Compte verrouillé pendant {duration}

# accountPermanentlyLocked
source: Account permanently locked. Please contact support.
ar: الحساب مقفل بشكل دائم. يرجى التواصل مع الدعم.
fr: Compte définitivement verrouillé. Veuillez contacter le support.

# tryAgainIn
source: Try again in {time}
ar: حاول مرة أخرى خلال {time}
fr: Réessayez dans {time}

# useBiometric
source: Use {type}
ar: استخدام {type}
fr: Utiliser {type}

source: Use passkey instead
ar: استخدام الرمز بدلاً من ذلك
fr: Utiliser le code à la place

source: Use PIN instead
ar: استخدام رمز PIN بدلاً من ذلك
fr: Utiliser le PIN à la place

source: Contact Support
ar: تواصل مع الدعم
fr: Contacter le support

source: PIN Code
ar: رمز PIN
fr: Code PIN

# sixDigitPin
source: 6-Digit PIN
ar: رمز PIN من 6 أرقام
fr: PIN à 6 chiffres

source: Set Up PIN Code
ar: إعداد رمز PIN
fr: Configurer le code PIN

source: Set Up PIN
ar: إعداد PIN
fr: Configurer PIN

# enterNewPin
source: Enter a 6-digit PIN to secure your account
ar: أدخل رمز PIN مكون من 6 أرقام لتأمين حسابك
fr: Entrez un PIN à 6 chiffres pour sécuriser votre compte

# pinSetupSuccess
source: PIN Code set up successfully
ar: تم إعداد رمز PIN بنجاح
fr: Code PIN configuré avec succès

source: Current PIN
ar: رمز PIN الحالي
fr: PIN actuel

# enterCurrentPin
source: Enter your current PIN
ar: أدخل رمز PIN الحالي
fr: Entrez votre PIN actuel

source: New PIN
ar: رمز PIN الجديد
fr: Nouveau PIN

# changePin
source: Change
ar: تغيير
fr: Modifier

# pinChangedSuccess
source: PIN changed successfully
ar: تم تغيير رمز PIN بنجاح
fr: PIN modifié avec succès

# removePin
source: Remove PIN Code
ar: حذف رمز PIN
fr: Supprimer le code PIN

# removePinConfirm
source: This will remove your PIN code. You can set up a new one anytime.
ar: سيؤدي هذا إلى حذف رمز PIN الخاص بك. يمكنك إعداد رمز جديد في أي وقت.
fr: Cela supprimera votre code PIN. Vous pouvez en configurer un nouveau à tout moment.

source: Verify PIN
ar: التحقق من رمز PIN
fr: Vérifier le PIN

# enterPinToRemove
source: Enter your PIN to confirm removal
ar: أدخل رمز PIN للتأكيد
fr: Entrez votre PIN pour confirmer

# pinRemovedSuccess
source: PIN Code removed
ar: تم حذف رمز PIN
fr: Code PIN supprimé

source: PIN must be 6 digits
ar: يجب أن يكون رمز PIN مكون من 6 أرقام
fr: Le PIN doit contenir 6 chiffres

source: Incorrect PIN
ar: رمز PIN غير صحيح
fr: PIN incorrect

# confirmPin
source: Confirm
ar: تأكيد
fr: Confirmer

source: PINs do not match
ar: رموز PIN غير متطابقة
fr: Les PINs ne correspondent pas

# pinEnabled
source: Enabled
ar: مفعّل
fr: Activé

# pinNotSet
source: Not set up
ar: غير مُعد
fr: Non configuré

# pinEnabledDescription
source: Your account is protected with a 6-digit PIN.
ar: حسابك محمي برمز PIN مكون من 6 أرقام.
fr: Votre compte est protégé par un PIN à 6 chiffres.

# pinDescription
source: Set up a 6-digit PIN as a backup method to unlock the app.
ar: قم بإعداد رمز PIN مكون من 6 أرقام كطريقة احتياطية لفتح التطبيق.
fr: Configurez un PIN à 6 chiffres comme méthode de secours pour déverrouiller l'application.

# enterPinToUnlock
source: Enter your PIN to unlock
ar: أدخل رمز PIN للفتح
fr: Entrez votre PIN pour déverrouiller

source: Device Passkey
ar: مفتاح المرور
fr: Clé d'accès

# passkeyShortDesc
source: Passwordless device login
ar: تسجيل دخول بدون كلمة مرور
fr: Connexion sans mot de passe

# twoFactorAuth
source: Two-Factor Authentication
ar: المصادقة الثنائية
fr: Authentification à deux facteurs

source: Authenticator App
ar: تطبيق المصادقة
fr: Application d'authentification

# twoFADescription
source: Use an authenticator app like Google Authenticator or Authy for additional security when logging in.
ar: استخدم تطبيق مصادقة مثل Google Authenticator أو Authy لأمان إضافي.
fr: Utilisez une application comme Google Authenticator ou Authy pour une sécurité supplémentaire.

source: Set Up 2FA
ar: إعداد المصادقة الثنائية
fr: Configurer 2FA

# pinRequiredForFaceId
source: Please set up PIN code first
ar: يرجى إعداد رمز PIN أولاً
fr: Veuillez d'abord configurer le code PIN

# requiresPinFirst
source: Requires PIN code
ar: يتطلب رمز PIN
fr: Nécessite un code PIN

source: PIN first
ar: PIN أولاً
fr: PIN d'abord

# securityInfoShort
source: Set up PIN code first, then enable Face ID for quick unlock. PIN is your backup if Face ID fails.
ar: قم بإعداد رمز PIN أولاً، ثم فعّل التعرف على الوجه للفتح السريع. رمز PIN هو الاحتياطي.
fr: Configurez d'abord le PIN, puis activez Face ID pour un déverrouillage rapide. Le PIN est votre secours.

# failedToSetupPin
source: Failed to set up PIN Code
ar: فشل إعداد رمز PIN
fr: Échec de la configuration du PIN

source: Failed to change PIN
ar: فشل تغيير رمز PIN
fr: Échec de la modification du PIN

source: Failed to remove PIN
ar: فشل حذف رمز PIN
fr: Échec de la suppression du PIN

# failedToUpdateBiometric
source: Failed to update biometric settings
ar: فشل تحديث إعدادات البيومترية
fr: Échec de la mise à jour des paramètres biométriques

# orDivider
source: OR
ar: أو
fr: OU

# codeExpiresAfterUse
source: Code expires after first use
ar: ينتهي الرمز بعد الاستخدام الأول
fr: Le code expire après la première utilisation

source: Sign in failed
ar: فشل تسجيل الدخول
fr: Échec de la connexion

source: Sign up failed
ar: فشل إنشاء الحساب
fr: Échec de l'inscription

source: Sign out failed
ar: فشل تسجيل الخروج
fr: Échec de la déconnexion

source: Google sign in failed
ar: فشل تسجيل الدخول بجوجل
fr: Échec de la connexion Google

source: Google sign up failed
ar: فشل إنشاء الحساب بجوجل
fr: Échec de l'inscription Google

# reenterPinToConfirm
source: Re-enter your PIN to confirm
ar: أعد إدخال رمز PIN للتأكيد
fr: Ressaisissez votre PIN pour confirmer

# continueText
source: Continue
ar: متابعة
fr: Continuer

source: Coming soon
ar: قريباً
fr: Bientôt disponible

source: Soon
ar: قريباً
fr: Bientôt

# featureComingSoon
source: This feature is coming soon!
ar: هذه الميزة قادمة قريباً!
fr: Cette fonctionnalité arrive bientôt!

source: Use another method
ar: استخدم طريقة أخرى
fr: Utiliser une autre méthode

source: Unlock Options
ar: خيارات إلغاء القفل
fr: Options de déverrouillage

# chooseUnlockMethod
source: Choose how to unlock
ar: اختر طريقة إلغاء القفل
fr: Choisissez comment déverrouiller

source: Try Face ID again
ar: حاول Face ID مرة أخرى
fr: Réessayer Face ID

source: Use Passkey
ar: استخدم مفتاح المرور
fr: Utiliser le passkey

source: Use 2FA Code
ar: استخدم رمز 2FA
fr: Utiliser le code 2FA

source: Enter 2FA Code
ar: أدخل رمز 2FA
fr: Entrez le code 2FA

# enter6DigitCode
source: Enter 6-digit code from your app
ar: أدخل الرمز المكون من 6 أرقام من تطبيقك
fr: Entrez le code à 6 chiffres de votre app

source: Verify Code
ar: تحقق من الرمز
fr: Vérifier le code

# invalidCode
source: Invalid code. Please try again.
ar: رمز غير صالح. حاول مرة أخرى.
fr: Code invalide. Veuillez réessayer.

source: No Internet Connection
ar: لا يوجد اتصال بالإنترنت
fr: Pas de connexion Internet

# offlineMessage
source: Please check your internet connection and try again. You need to be connected to use this app.
ar: يرجى التحقق من اتصالك بالإنترنت والمحاولة مرة أخرى. يجب أن تكون متصلاً لاستخدام هذا التطبيق.
fr: Veuillez vérifier votre connexion Internet et réessayer. Vous devez être connecté pour utiliser cette application.

# connectionTip
source: Tip: Try enabling Wi-Fi or mobile data
ar: نصيحة: حاول تفعيل الواي فاي أو بيانات الهاتف
fr: Astuce: Essayez d'activer le Wi-Fi ou les données mobiles

source: Close App
ar: إغلاق التطبيق
fr: Fermer l'application

# retryHint
source: App will automatically reconnect when online
ar: سيتصل التطبيق تلقائياً عند الاتصال بالإنترنت
fr: L'application se reconnectera automatiquement en ligne

source: Change Password
ar: تغيير كلمة المرور
fr: Changer le mot de passe

# changePasswordDesc
source: Update your account password
ar: تحديث كلمة مرور حسابك
fr: Mettre à jour le mot de passe de votre compte

# changePasswordDialogDesc
source: Enter your current password and choose a new one
ar: أدخل كلمة المرور الحالية واختر كلمة مرور جديدة
fr: Entrez votre mot de passe actuel et choisissez-en un nouveau

source: Current Password
ar: كلمة المرور الحالية
fr: Mot de passe actuel

# currentPasswordRequired
source: Current password is required
ar: كلمة المرور الحالية مطلوبة
fr: Le mot de passe actuel est requis

source: Password does not meet requirements
ar: كلمة المرور لا تستوفي المتطلبات
fr: Le mot de passe ne répond pas aux exigences

# newPasswordMustBeDifferent
source: New password must be different from current password
ar: كلمة المرور الجديدة يجب أن تكون مختلفة عن الحالية
fr: Le nouveau mot de passe doit être différent de l'actuel

# passwordChangedSuccess
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح
fr: Mot de passe changé avec succès

source: Failed to change password
ar: فشل في تغيير كلمة المرور
fr: Échec du changement de mot de passe

source: Create Password
ar: إنشاء كلمة مرور
fr: Créer un mot de passe

# createPasswordDesc
source: Create a password for your account
ar: أنشئ كلمة مرور لحسابك
fr: Créez un mot de passe pour votre compte

source: Password
ar: كلمة المرور
fr: Mot de passe

# passwordCreatedSuccess
source: Password created successfully
ar: تم إنشاء كلمة المرور بنجاح
fr: Mot de passe créé avec succès

source: Failed to create password
ar: فشل في إنشاء كلمة المرور
fr: Échec de la création du mot de passe

source: Alternative Unlock
ar: فتح بديل
fr: Déverrouillage alternatif

# chooseSecureMethod
source: Choose a secure method to unlock
ar: اختر طريقة آمنة للفتح
fr: Choisissez une méthode sécurisée

source: Authenticator Code
ar: رمز المصادقة
fr: Code d'authentification

# twoFAEnabled
source: Enabled
ar: مفعّل
fr: Activé

# twoFADisabled
source: 2FA disabled
ar: تم تعطيل المصادقة الثنائية
fr: 2FA désactivé

source: Disable 2FA
ar: تعطيل المصادقة الثنائية
fr: Désactiver 2FA

# pinRequiredFor2FA
source: Please set up PIN code first
ar: يرجى إعداد رمز PIN أولاً
fr: Veuillez d'abord configurer le code PIN

# enterSixDigitCode
source: Please enter 6-digit code
ar: يرجى إدخال الرمز المكون من 6 أرقام
fr: Veuillez entrer le code à 6 chiffres

# enterCodeToDisable2FA
source: Enter the code from your authenticator app to confirm
ar: أدخل الرمز من تطبيق المصادقة للتأكيد
fr: Entrez le code de votre application d'authentification pour confirmer

# twoFactorEnabled
source: Two-factor authentication enabled!
ar: تم تفعيل المصادقة الثنائية!
fr: Authentification à deux facteurs activée !

# secretCopied
source: Secret key copied to clipboard
ar: تم نسخ المفتاح السري
fr: Clé secrète copiée dans le presse-papiers

# scanQrCode
source: Scan this QR code
ar: امسح رمز QR هذا
fr: Scanner ce code QR

# useAuthenticatorApp
source: Open your authenticator app and scan this QR code to add your account
ar: افتح تطبيق المصادقة وامسح رمز QR هذا لإضافة حسابك
fr: Ouvrez votre application d'authentification et scannez ce code QR pour ajouter votre compte

# enterManually
source: Enter this key manually
ar: أدخل هذا المفتاح يدوياً
fr: Entrer cette clé manuellement

source: Copy secret key
ar: نسخ المفتاح السري
fr: Copier la clé secrète

# authenticatorAccountInfo
source: The account name in your authenticator app will be your email address
ar: سيكون اسم الحساب في تطبيق المصادقة هو عنوان بريدك الإلكتروني
fr: Le nom du compte dans votre application d'authentification sera votre adresse email

source: Enter Verification Code
ar: أدخل رمز التحقق
fr: Entrer le code de vérification

# enterCodeFromAuthenticator
source: Enter the 6-digit code from your authenticator app to complete setup
ar: أدخل الرمز المكون من 6 أرقام من تطبيق المصادقة لإكمال الإعداد
fr: Entrez le code à 6 chiffres de votre application d'authentification pour terminer la configuration

# codeRefreshesEvery30Seconds
source: Codes refresh every 30 seconds. Make sure to enter the current code.
ar: تتجدد الرموز كل 30 ثانية. تأكد من إدخال الرمز الحالي.
fr: Les codes se rafraîchissent toutes les 30 secondes. Assurez-vous d'entrer le code actuel.

# activateTwoFactor
source: Activate 2FA
ar: تفعيل المصادقة الثنائية
fr: Activer 2FA

# orText
source: OR
ar: أو
fr: ou

source: Disable
ar: تعطيل
fr: Désactiver

source: Mark all read
ar: قراءة الكل
fr: Tout marquer lu

# noNotifications
source: No notifications yet
ar: لا توجد إشعارات
fr: Aucune notification

# noNotificationsDesc
source: You'll see important updates here
ar: ستظهر التحديثات المهمة هنا
fr: Les mises à jour importantes apparaîtront ici

# allNotificationsRead
source: All notifications marked as read
ar: تم تحديد جميع الإشعارات كمقروءة
fr: Toutes les notifications marquées comme lues

source: Complete Profile
ar: أكمل الملف
fr: Compléter le profil

source: Setup Security
ar: إعداد الأمان
fr: Configurer sécurité

source: View Details
ar: عرض التفاصيل
fr: Voir détails

# notificationWelcomeTitle
source: Welcome to Cha9cha9ni
ar: مرحبًا بك في شقشقني
fr: Bienvenue sur Cha9cha9ni

# notificationWelcomeMessage
source: We're excited to have you join our community! If you need any help, don't hesitate to contact our support team at support@cha9cha9ni.tn or use the Help option in the menu.
ar: يسعدنا انضمامك إلى مجتمعنا! إذا كنت بحاجة إلى أي مساعدة، لا تتردد في التواصل مع فريق الدعم على support@cha9cha9ni.tn أو استخدم خيار المساعدة في القائمة.
fr: Nous sommes ravis de vous accueillir dans notre communauté ! Si vous avez besoin d'aide, n'hésitez pas à contacter notre équipe de support à support@cha9cha9ni.tn ou utilisez l'option Aide dans le menu.

# notificationProfileTitle
source: Complete Your Profile
ar: أكمل ملفك الشخصي
fr: Complétez votre profil

# notificationProfileMessage
source: To make withdrawals and access all our features, please complete your personal information in your profile settings. This helps us verify your identity and keep your account secure.
ar: لإجراء عمليات السحب والوصول إلى جميع ميزاتنا، يرجى إكمال معلوماتك الشخصية في إعدادات ملفك الشخصي. هذا يساعدنا على التحقق من هويتك والحفاظ على أمان حسابك.
fr: Pour effectuer des retraits et accéder à toutes nos fonctionnalités, veuillez compléter vos informations personnelles dans les paramètres de votre profil. Cela nous aide à vérifier votre identité et à sécuriser votre compte.

# notificationSecurityTitle
source: Secure Your Account
ar: تأمين حسابك
fr: Sécurisez votre compte

# notificationSecurityMessage
source: Protect your account by enabling two-factor authentication (2FA) and setting up a PIN code. This will help safeguard your data and transactions from unauthorized access.
ar: احمِ حسابك من خلال تفعيل المصادقة الثنائية (2FA) وإعداد رمز PIN. سيساعدك هذا على حماية بياناتك ومعاملاتك من أي وصول غير مصرح به.
fr: Protégez votre compte en activant l'authentification à deux facteurs (2FA) et en configurant un code PIN. Cela vous aidera à protéger vos données et transactions contre tout accès non autorisé.

source: Read
ar: مقروء
fr: Lu

source: No recent activities
ar: لا توجد أنشطة حديثة
fr: Aucune activité récente

# wantsToRemoveYou
source: Wants to remove
ar: يريد إزالتك
fr: Veut vous retirer

# ownerRequestedRemoval
source: {ownerName} has requested to remove you from the family
ar: {ownerName} طلب إزالتك من العائلة
fr: {ownerName} a demandé à vous retirer de la famille

source: Respond
ar: رد
fr: Répondre

source: Signing you in...
ar: جاري تسجيل دخولك...
fr: Connexion en cours...

source: Just now
ar: الآن
fr: À l'instant

# minAgo
source: {count} min ago
ar: منذ دقيقة
fr: Il y a {count} min

# minsAgo
source: {count} mins ago
ar: منذ {count} دقائق
fr: Il y a {count} mins

# hourAgo
source: {count} hour ago
ar: منذ ساعة
fr: Il y a {count} heure

# hoursAgo
source: {count} hours ago
ar: منذ {count} ساعات
fr: Il y a {count} heures

# dayAgo
source: {count} day ago
ar: منذ يوم
fr: Il y a {count} jour

# daysAgo
source: {count} days ago
ar: منذ {count} أيام
fr: Il y a {count} jours

# monthAgo
source: {count} month ago
ar: منذ شهر
fr: Il y a {count} mois

# monthsAgo
source: {count} months ago
ar: منذ {count} أشهر
fr: Il y a {count} mois

source: Loading...
ar: جار التحميل...
fr: Chargement...

# scanCode
source: Redeem Gift Card
ar: استبدال بطاقة الهدايا
fr: Utiliser une carte cadeau

source: Camera Permission Required
ar: إذن الكاميرا مطلوب
fr: Autorisation de la caméra requise

# cameraPermissionDescription
source: We need camera access to scan gift card codes and QR codes.
ar: نحتاج إلى الوصول إلى الكاميرا لمسح رموز بطاقات الهدايا ورموز QR.
fr: Nous avons besoin d'accéder à la caméra pour scanner les codes de cartes cadeaux et les codes QR.

source: Open Settings
ar: فتح الإعدادات
fr: Ouvrir les paramètres

# pointCameraAtCode
source: Point camera at gift card code
ar: وجّه الكاميرا نحو رمز بطاقة الهدايا
fr: Pointez la caméra vers le code de la carte cadeau

source: Enter Code Manually
ar: أدخل الرمز يدوياً
fr: Entrer le code manuellement

source: Scan Instead
ar: مسح بدلاً من ذلك
fr: Scanner à la place

# enterCodeDescription
source: Enter the gift card code to add balance to your account
ar: أدخل رمز بطاقة الهدايا لإضافة رصيد إلى حسابك
fr: Entrez le code de la carte cadeau pour ajouter du solde à votre compte

# invalidCodeFormat
source: Please enter a valid redemption code
ar: يرجى إدخال رمز استبدال صالح
fr: Veuillez entrer un code de remboursement valide

source: Code Scanned!
ar: تم مسح الرمز!
fr: Code scanné!

# joinFamily
source: Redeem
ar: استبدال
fr: Utiliser

# rewardsPoints
source: points
ar: نقاط

# rewardsStreak
source: Streak
ar: سلسلة
fr: Série

# rewardsAds
source: Ads
ar: إعلانات
fr: Pubs

# rewardsDailyCheckIn
source: Daily Check-in
ar: تسجيل الدخول اليومي
fr: Connexion quotidienne

# rewardsDayStreak
source: {count} day streak!
ar: سلسلة {count} يوم!
fr: Série de {count} jours!

# rewardsClaimPoints
source: Claim +{points} pts
ar: احصل على +{points} نقطة
fr: Réclamer +{points} pts

# rewardsClaimed
source: Claimed
ar: تم الحصول
fr: Réclamé

# rewardsNextIn
source: Next in
ar: التالي في
fr: Prochain dans

# rewardsWatchAndEarn
source: Watch & Earn
ar: شاهد واكسب
fr: Regarder et Gagner

# rewardsWatchAdToEarn
source: Watch ad to earn +{points} pts
ar: شاهد إعلان لكسب +{points} نقطة
fr: Regardez une pub pour gagner +{points} pts

# rewardsAllAdsWatched
source: All ads watched today!
ar: شاهدت جميع الإعلانات اليوم!
fr: Toutes les pubs vues aujourd'hui!

# rewardsRedeemRewards
source: Redeem Rewards
ar: استبدال المكافآت
fr: Échanger les récompenses

# rewardsConvertPoints
source: Convert points to TND
ar: تحويل النقاط إلى دينار
fr: Convertir les points en TND

# rewardsRedeem
source: Redeem
ar: استبدال
fr: Échanger

# rewardsComingSoon
source: Coming Soon!
ar: قريباً!
fr: Bientôt disponible!

# rewardsRedeemingFor
source: Redeeming {name} for {points} points will be available soon!
ar: استبدال {name} مقابل {points} نقطة سيكون متاحاً قريباً!
fr: L'échange de {name} pour {points} points sera bientôt disponible!

# rewardsGotIt
source: Got it!
ar: فهمت!
fr: Compris!

# rewardsSimulatedAd
source: Simulated Ad
ar: إعلان تجريبي
fr: Pub simulée

# rewardsSimulatedAdDesc
source: In production, a real rewarded ad would play here.
ar: في الإنتاج، سيتم عرض إعلان حقيقي مع مكافأة هنا.
fr: En production, une vraie pub avec récompense serait diffusée ici.

# rewardsSkipAd
source: Skip Ad
ar: تخطي الإعلان
fr: Passer la pub

# rewardsWatchComplete
source: Watch Complete
ar: اكتمل المشاهدة
fr: Visionnage terminé

# rewardsPointsEarned
source: Points earned!
ar: تم كسب النقاط!
fr: Points gagnés!

# rewardsAdReward
source: Ad Reward
ar: مكافأة الإعلان
fr: Récompense pub

# rewardsDailyReward
source: Daily Reward
ar: المكافأة اليومية
fr: Récompense quotidienne

# rewardsLoadingAd
source: Loading ad...
ar: جاري تحميل الإعلان...
fr: Chargement de la pub...

# rewardsCheckInSuccess
source: Check-in successful!
ar: تم تسجيل الدخول بنجاح!
fr: Connexion réussie!

# rewardsCheckInFailed
source: Check-in failed. Please try again.
ar: فشل تسجيل الدخول. يرجى المحاولة مرة أخرى.
fr: Échec de la connexion. Veuillez réessayer.

# rewardsClaimFailed
source: Failed to claim reward. Please try again.
ar: فشل في الحصول على المكافأة. يرجى المحاولة مرة أخرى.
fr: Échec de la réclamation. Veuillez réessayer.

# rewardsAdFailed
source: Ad failed to show. Please try again.
ar: فشل في عرض الإعلان. يرجى المحاولة مرة أخرى.
fr: La pub n'a pas pu s'afficher. Veuillez réessayer.

source: All Activities
ar: جميع الأنشطة
fr: Toutes les activités

# activitiesWillAppearHere
source: Family activities will appear here when members earn points
ar: ستظهر أنشطة العائلة هنا عندما يكسب الأعضاء نقاط
fr: Les activités familiales apparaîtront ici quand les membres gagnent des points

source: Today
ar: اليوم
fr: Aujourd'hui

source: Yesterday
ar: أمس
fr: Hier
